package com.group1.bankproject.bankproduct;


/**
 * 
 * 줄구분자, 은행 로고 메소드를 포함한 클래스입니다.
 * 
 * @author 1조
 *
 */
public class Liner {
	
	/**
	 * 화면전환 시 줄간격, 은행로고를 포함한 메소드입니다.
	 * 
	 */
	
	public static void clearScreen() {
	    for (int i = 0; i < 42; i++) {
	      System.out.println("");}
	    
	
		System.out.println("███████╗██╗   ██╗██████╗  █████╗ ███╗   ██╗██╗  ██╗\r\n"
				+ "██╔════╝╚██╗ ██╔╝██╔══██╗██╔══██╗████╗  ██║██║ ██╔╝\r\n"
				+ "███████╗ ╚████╔╝ ██████╔╝███████║██╔██╗ ██║█████╔╝ \r\n"
				+ "╚════██║  ╚██╔╝  ██╔══██╗██╔══██║██║╚██╗██║██╔═██╗ \r\n"
				+ "███████║   ██║   ██████╔╝██║  ██║██║ ╚████║██║  ██╗\r\n"
				+ "╚══════╝   ╚═╝   ╚═════╝ ╚═╝  ╚═╝╚═╝  ╚═══╝╚═╝  ╚═╝\r\n"
				+ "                                                   ");
			
		
	    
	    
}
	
	/**
	 * 기본 줄구분선 메소드입니다.
	 */
	
	public static void equalLine() {
		System.out.println("====================================================");
}
	/**
	 * 선택 줄구분선 메소드입니다.
	 */
	public static void minusLine() {
		System.out.println("——————————————————————————");
}

}
